Revit 2024 API
BuiltInFailures.GenericFailures Class
 Generic failures that may apply to any Revit Element
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class GenericFailures
Visual Basic
Public NotInheritable Class GenericFailures
Visual C++
public ref class GenericFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.GenericFailures
See Also
BuiltInFailures.GenericFailures Members
Autodesk.Revit.DB Namespace